{
  "abdominals": {
    "exercises": [
      {
        "name": "Crunches",
        "primary_muscle": "abdominals",
        "secondary_muscles": [],
        "difficulty": "novice",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Lie flat on your back with knees bent and feet on the floor. 2: Cross your arms over your chest or place your hands lightly behind your head. 3: Contract your abs to lift your head and shoulders off the floor, then slowly lower back down."
      },
      {
        "name": "Forearm Plank",
        "primary_muscle": "abdominals",
        "secondary_muscles": [
          "obliques",
          "lowerback"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Lie face-down and prop yourself up on your forearms and toes. 2: Keep your body in a straight line from head to heels. 3: Brace your core and hold the position without letting your hips sag."
      },
      {
        "name": "Cable Rope Kneeling Crunch",
        "primary_muscle": "abdominals",
        "secondary_muscles": [],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Attach a rope handle to a high pulley and kneel in front of the machine, holding the rope by your ears. 2: Crunch your torso downward, using your abs to pull your elbows toward your thighs. 3: Pause briefly at the bottom, then return to the starting position under control."
      },
      {
        "name": "Barbell Sit-Up",
        "primary_muscle": "abdominals",
        "secondary_muscles": [
          "hip flexors"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Lie on your back holding a barbell secured above your chest with arms extended. 2: Engage your core and sit up, keeping the barbell overhead as your torso rises. 3: Control the descent as you lie back down, maintaining tight abs throughout."
      },
      {
        "name": "Barbell Roll-Out",
        "primary_muscle": "abdominals",
        "secondary_muscles": [
          "shoulders",
          "lats"
        ],
        "difficulty": "advanced",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Kneel on the floor and grasp a barbell loaded with round plates, hands shoulder-width apart. 2: Slowly roll the barbell forward, extending your arms and hips while keeping your core tight, until your torso is near parallel to the floor. 3: Use your abs to pull the barbell back toward your knees to return to the start."
      },
      {
        "name": "Kettlebell Sit-Up",
        "primary_muscle": "abdominals",
        "secondary_muscles": [],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Lie flat on your back with knees bent and hold a kettlebell against your chest. 2: Engage your core and sit up until your torso is vertical, keeping the kettlebell in place. 3: Lower yourself back down with control to the starting position."
      }
    ]
  },
  "biceps": {
    "exercises": [
      {
        "name": "Dumbbell Bicep Curl",
        "primary_muscle": "biceps",
        "secondary_muscles": [
          "forearms"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Stand holding a dumbbell in each hand at your sides, palms facing forward. 2: Keeping your elbows close to your torso, curl the weights upward by bending at the elbow. 3: Squeeze your biceps at the top, then slowly lower the dumbbells back down to the starting position."
      },
      {
        "name": "Dumbbell Hammer Curl",
        "primary_muscle": "biceps",
        "secondary_muscles": [
          "forearms"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Stand with a dumbbell in each hand, arms at your sides and palms facing inward (neutral grip). 2: Bend at the elbows to curl the weights up toward your shoulders, keeping your palms facing each other throughout. 3: Control the motion as you lower the dumbbells back to the starting position."
      },
      {
        "name": "Cable Single-Arm Hammer Curl",
        "primary_muscle": "biceps",
        "secondary_muscles": [
          "forearms"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Stand beside a low cable pulley and grab the handle with an underhand neutral grip (thumb facing up). 2: Keeping your elbow at your side, curl your hand toward your shoulder, contracting your bicep. 3: Squeeze at the top, then slowly straighten your arm back down. Repeat on the other arm."
      },
      {
        "name": "Barbell Bicep Curl",
        "primary_muscle": "biceps",
        "secondary_muscles": [
          "forearms"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Stand holding a barbell with an underhand grip, hands about shoulder-width apart. 2: Keeping your elbows tucked to your sides, curl the barbell upward toward your chest by flexing your elbows. 3: Pause briefly once your biceps are fully contracted, then lower the barbell back down in a controlled manner."
      }
    ]
  },
  "calves": {
    "exercises": [
      {
        "name": "Standing Calf Raise",
        "primary_muscle": "calves",
        "secondary_muscles": [],
        "difficulty": "beginner",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Stand on the edge of a step with the balls of your feet on the surface and heels hanging off. 2: Hold onto a wall or rail for balance if needed, then lower your heels to feel a stretch in your calves. 3: Press through the balls of your feet to raise your heels as high as possible, then slowly lower back down."
      },
      {
        "name": "Barbell Calf Raise",
        "primary_muscle": "calves",
        "secondary_muscles": [],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Stand upright with a barbell resting across your upper back (as in a squat position) and feet shoulder-width apart. 2: Keeping your legs straight, rise up onto your toes as high as you can, contracting your calf muscles at the top. 3: Pause briefly, then lower your heels back down to the floor under control."
      },
      {
        "name": "Machine Standing Calf Raise",
        "primary_muscle": "calves",
        "secondary_muscles": [],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Position your shoulders under the pads of a standing calf raise machine and the balls of your feet on the platform. 2: Keeping your knees slightly unlocked, lower your heels toward the floor to stretch your calves. 3: Press through the balls of your feet to raise your heels as high as possible, then slowly return to the lowered position."
      },
      {
        "name": "Machine Seated Calf Raise",
        "primary_muscle": "calves",
        "secondary_muscles": [],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Sit in a seated calf raise machine and place the balls of your feet on the foot platform with your knees under the pads. 2: Release the safety and lower your heels to stretch the calves. 3: Push through your toes to lift your heels upward, raising the weight as high as possible, then lower back down under control."
      },
      {
        "name": "Treadmill Calf Walk",
        "primary_muscle": "calves",
        "secondary_muscles": [],
        "difficulty": "beginner",
        "equipment": {
          "type": "cardio"
        },
        "instructions": "1: Set a treadmill to a moderate incline and a comfortable walking speed. 2: Walk on the balls of your feet, keeping your strides short and focusing on each calf contraction with every step. 3: Continue walking on your tiptoes for the desired time or distance to work the calves."
      }
    ]
  },
  "chest": {
    "exercises": [
      {
        "name": "Push-Up",
        "primary_muscle": "chest",
        "secondary_muscles": [
          "triceps",
          "front-shoulders"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Start in a high plank position with hands on the floor slightly wider than shoulder-width and legs extended. 2: Keep your body in a straight line and bend your elbows to lower your chest toward the floor. 3: Push through your palms to extend your arms and return to the starting position."
      },
      {
        "name": "Knee Push-Up",
        "primary_muscle": "chest",
        "secondary_muscles": [
          "triceps",
          "front-shoulders"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Begin in a modified plank position, supporting your body on your hands and knees with your body forming a straight line from shoulders to knees. 2: Bend your elbows to lower your chest toward the floor while keeping your core engaged. 3: Press back up to straighten your arms, maintaining alignment from your head to your knees."
      },
      {
        "name": "Barbell Bench Press",
        "primary_muscle": "chest",
        "secondary_muscles": [
          "triceps",
          "front-shoulders"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Lie flat on a bench and grasp the barbell with hands slightly wider than shoulder-width. 2: Unrack the bar and position it above your chest with arms extended. Lower the barbell to your mid-chest by bending your elbows. 3: Press the barbell upward, extending your arms, to return to the starting position."
      },
      {
        "name": "Dumbbell Incline Bench Press",
        "primary_muscle": "chest",
        "secondary_muscles": [
          "triceps",
          "front-shoulders"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Lie on an incline bench (around 30–45°) with a dumbbell in each hand at shoulder level, palms facing forward. 2: Press the dumbbells upward until your arms are fully extended above your chest. 3: Lower the weights back down to the starting position under control, keeping your elbows at about a 45° angle to your body."
      },
      {
        "name": "Cable Chest Fly",
        "primary_muscle": "chest",
        "secondary_muscles": [
          "front-shoulders"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Stand centered between two high cable pulleys with a handle in each hand, arms out to your sides slightly bent. 2: Keeping a slight bend in your elbows, bring your hands together in front of your chest by contracting your chest muscles. 3: Slowly allow your arms to move back to the starting position, feeling the stretch across your chest."
      },
      {
        "name": "Explosive Push-Up",
        "primary_muscle": "chest",
        "secondary_muscles": [
          "triceps",
          "front-shoulders"
        ],
        "difficulty": "advanced",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Assume a standard push-up position with your body straight and hands shoulder-width apart. 2: Lower your chest toward the ground as in a regular push-up. 3: Push up forcefully enough that your hands come off the floor briefly, then catch yourself and immediately go into the next rep."
      }
    ]
  },
  "forearms": {
    "exercises": [
      {
        "name": "Dumbbell Wrist Supination/Pronation",
        "primary_muscle": "forearms",
        "secondary_muscles": [],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Sit on a bench and hold a light dumbbell in one hand with your elbow bent 90° and rested on your thigh. 2: Rotate your wrist, turning the dumbbell from palm-up (supinated) to palm-down (pronated) slowly through a full range of motion. 3: Continue rotating back and forth, then switch to the other arm."
      },
      {
        "name": "Dumbbell Wrist Curl",
        "primary_muscle": "forearms",
        "secondary_muscles": [],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Sit on a bench holding a dumbbell in one hand, palm facing up, and rest that forearm on your thigh or a flat surface with your wrist just beyond the edge. 2: Allow the dumbbell to roll to your fingertips, then curl your wrist upward, closing your hand and lifting the weight toward your forearm. 3: Lower the weight back down to the starting position under control and repeat."
      },
      {
        "name": "Dumbbell Wrist Extension",
        "primary_muscle": "forearms",
        "secondary_muscles": [],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Sit with your forearm resting on a bench or your thigh, palm facing down while holding a light dumbbell. 2: Moving only at the wrist, raise the back of your hand by extending your wrist, lifting the weight upward. 3: Lower the dumbbell back down slowly to the starting position. Repeat for the desired reps and switch hands."
      },
      {
        "name": "Plate-Weighted Dead Hang",
        "primary_muscle": "forearms",
        "secondary_muscles": [
          "upper back"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Using a dip belt, attach a weight plate and then grip an overhead pull-up bar with palms facing forward. 2: Lift your feet off the ground and hang with arms fully extended, supporting your body and the extra weight. 3: Hold the hang position for as long as possible or the specified time, then carefully lower yourself down."
      }
    ]
  },
  "front-shoulders": {
    "exercises": [
      {
        "name": "Wall Angels",
        "primary_muscle": "front-shoulders",
        "secondary_muscles": [
          "rear-shoulders",
          "upper back"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Stand with your back against a wall, arms bent 90° with the backs of your hands against the wall. 2: Keep your shoulders, elbows, and wrists in contact with the wall as you slowly raise your arms overhead. 3: Lower your arms back down, maintaining contact with the wall, and repeat."
      },
      {
        "name": "Cable Internal Rotation",
        "primary_muscle": "front-shoulders",
        "secondary_muscles": [
          "rotator cuff"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Stand next to a cable machine with the pulley set at elbow height. Grasp the handle with the hand closest to the machine. 2: Start with your elbow bent 90° and your forearm out to the side (arm externally rotated). 3: Pull the handle across your body, rotating your forearm inward keeping your elbow pressed to your side. Return slowly to the start and repeat."
      },
      {
        "name": "Dumbbell Six-Way Raise",
        "primary_muscle": "front-shoulders",
        "secondary_muscles": [
          "lateral shoulders",
          "rear-shoulders"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Stand holding light dumbbells at your sides. 2: Raise the weights straight out in front of you to shoulder height, then move them out to the sides at shoulder height, and finally lower them down to your sides. 3: Next, reverse the motion: lift the dumbbells out to the sides up to shoulder height, bring them forward to shoulder height, then lower them down in front of you."
      },
      {
        "name": "Machine Overhead Press",
        "primary_muscle": "front-shoulders",
        "secondary_muscles": [
          "triceps"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Sit at an overhead press machine, grasping the handles at shoulder level with an overhand grip. 2: Press the handles upward until your arms are fully extended overhead. 3: Control the weight as you bend your arms to return the handles back down to the starting position."
      },
      {
        "name": "Dumbbell Cuban Press",
        "primary_muscle": "front-shoulders",
        "secondary_muscles": [
          "rear-shoulders",
          "rotator cuff"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Stand holding dumbbells and lift your arms out to the sides, elbows bent 90° (dumbbells at shoulder height). 2: Rotate your shoulders to bring the dumbbells up (externally rotating) until your forearms point upward. 3: Press the dumbbells overhead until arms are straight, then reverse the motion: lower back to 90° elbows, rotate forearms down to shoulder height, and lower arms."
      }
    ]
  },
  "glutes": {
    "exercises": [
      {
        "name": "Forward Lunge",
        "primary_muscle": "glutes",
        "secondary_muscles": [
          "quads",
          "hamstrings"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Stand upright and take a long step forward with one foot. 2: Lower your body by bending both knees until your front thigh is roughly parallel to the floor and your back knee nearly touches the ground. 3: Push through the heel of your front foot to return to standing, then repeat with the opposite leg."
      },
      {
        "name": "Barbell Hip Thrust",
        "primary_muscle": "glutes",
        "secondary_muscles": [
          "hamstrings",
          "quads"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Sit on the ground with your upper back against a bench and a barbell positioned across your hips. 2: Drive through your heels to thrust your hips upward, lifting the barbell by squeezing your glutes until your torso is parallel to the floor. 3: Pause briefly at the top, then lower your hips back down to the starting position."
      },
      {
        "name": "Band Glute Kickback",
        "primary_muscle": "glutes",
        "secondary_muscles": [
          "hamstrings"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Loop a resistance band around a sturdy anchor at ankle height and attach the other end to one ankle. Face the anchor on one leg. 2: Keeping your torso stable, extend your banded leg straight back, squeezing your glute. 3: Return your leg to the starting position with control. Complete all reps then switch legs."
      },
      {
        "name": "Plate Squat",
        "primary_muscle": "glutes",
        "secondary_muscles": [
          "quads"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Stand with feet shoulder-width apart while holding a weight plate (or single dumbbell) close to your chest. 2: Push your hips back and bend your knees to squat down until your thighs are parallel to the floor (or as low as comfortable). 3: Drive through your heels to stand back up to the starting position, keeping your chest up throughout the movement."
      },
      {
        "name": "Bodyweight Figure-Four Hip Thrust",
        "primary_muscle": "glutes",
        "secondary_muscles": [
          "hamstrings"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Sit on the floor with your upper back against a bench and one ankle crossed over the opposite knee (making a figure-four shape). 2: With the supporting foot flat on the ground, drive your hips upward, squeezing your glutes, until your body forms a straight line from shoulder to knee. 3: Lower your hips back down under control. Perform all reps on one side, then switch."
      },
      {
        "name": "Barbell Staggered Glute Bridge",
        "primary_muscle": "glutes",
        "secondary_muscles": [
          "hamstrings",
          "quads"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Lie on your back with one foot flat on the floor and the other foot a step forward (staggered stance), and place a barbell across your hips. 2: Drive through the heel of the closer foot to lift your hips up, extending as high as possible and squeezing your glutes. 3: Lower your hips back down, keeping the barbell steady. Repeat and alternate stance as needed."
      }
    ]
  },
  "hamstrings": {
    "exercises": [
      {
        "name": "Machine Hamstring Curl",
        "primary_muscle": "hamstrings",
        "secondary_muscles": [],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Adjust the leg curl machine so the padded lever is just above your heels when seated or lying (depending on machine type). 2: Curl your legs by bending your knees, bringing your heels toward your buttocks, squeezing your hamstrings. 3: Slowly return the weight to the starting position, keeping control throughout the movement."
      },
      {
        "name": "Barbell Romanian Deadlift",
        "primary_muscle": "hamstrings",
        "secondary_muscles": [
          "glutes",
          "lowerback"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Stand with feet hip-width apart holding a barbell in front of your thighs. 2: Keeping your back flat and knees slightly bent, hinge at the hips to lower the barbell down your legs until you feel a stretch in your hamstrings. 3: Squeeze your glutes and drive your hips forward to raise the barbell back up to the starting position."
      },
      {
        "name": "Barbell Good Morning",
        "primary_muscle": "hamstrings",
        "secondary_muscles": [
          "glutes",
          "lowerback"
        ],
        "difficulty": "advanced",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Stand with a barbell resting on your upper back (like a squat position) and feet shoulder-width apart. 2: Keep a slight bend in your knees and a flat back as you hinge forward at the hips, lowering your torso until you feel tension in your hamstrings. 3: Contract your hamstrings and glutes to reverse the motion and raise your torso back to upright."
      },
      {
        "name": "Nordic Hamstring Curl",
        "primary_muscle": "hamstrings",
        "secondary_muscles": [
          "glutes"
        ],
        "difficulty": "advanced",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Kneel on a padded surface and anchor your feet under a stable object or have a partner hold your ankles. 2: Keep your body straight from head to knees and slowly lean forward, resisting the fall with your hamstrings as long as possible. 3: Catch yourself with your hands on the ground, then push back up and curl your hamstrings to return to the starting upright position."
      }
    ]
  },
  "lats": {
    "exercises": [
      {
        "name": "Dumbbell Bent-Over Row",
        "primary_muscle": "lats",
        "secondary_muscles": [
          "traps-middle",
          "biceps"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Stand with feet shoulder-width apart and bend at the hips, keeping your back flat, holding a dumbbell in each hand hanging down. 2: Pull the dumbbells up toward your ribcage by driving your elbows back and up, squeezing your shoulder blades together. 3: Lower the weights back down under control to the starting position."
      },
      {
        "name": "Lat Pulldown",
        "primary_muscle": "lats",
        "secondary_muscles": [
          "biceps"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Sit at a lat pulldown station and grasp the bar with a wide overhand grip. 2: Slightly lean back and pull the bar down to your upper chest by driving your elbows toward the ground, squeezing your lats. 3: Slowly extend your arms to let the bar rise back to the top position without shrugging your shoulders."
      },
      {
        "name": "Pull-Up",
        "primary_muscle": "lats",
        "secondary_muscles": [
          "biceps",
          "traps-middle"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Hang from a pull-up bar with an overhand grip slightly wider than shoulder-width. 2: Pull your body upward by driving your elbows down and back, aiming to get your chin over the bar. 3: Lower yourself back down in a controlled manner until your arms are fully extended."
      },
      {
        "name": "Barbell Bent-Over Row",
        "primary_muscle": "lats",
        "secondary_muscles": [
          "traps-middle",
          "biceps"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Stand with feet hip-width apart and hold a barbell with an overhand grip. Bend at the hips until your torso is roughly 45° to the floor, keeping your back straight. 2: Pull the barbell up toward your abdomen, leading with your elbows and squeezing your back muscles. 3: Lower the barbell back down under control, extending your arms fully at the bottom."
      },
      {
        "name": "Barbell Landmine Row",
        "primary_muscle": "lats",
        "secondary_muscles": [
          "traps-middle",
          "biceps"
        ],
        "difficulty": "advanced",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Secure one end of a barbell in a landmine attachment or corner. Straddle the barbell and bend at the hips with a flat back, grasping the barbell near the weighted end. 2: Row the barbell up toward your chest by pulling your elbows back, squeezing your lats and mid-back. 3: Lower the bar down in a controlled manner until your arms are extended again."
      }
    ]
  },
  "lowerback": {
    "exercises": [
      {
        "name": "Superman",
        "primary_muscle": "lowerback",
        "secondary_muscles": [
          "glutes"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Lie face-down on the floor with your arms extended in front of you. 2: Simultaneously lift your chest, arms, and legs off the ground a few inches, contracting your lower back and glute muscles. 3: Hold briefly at the top, then lower your arms and legs back down to the floor."
      },
      {
        "name": "Partner Back Extension",
        "primary_muscle": "lowerback",
        "secondary_muscles": [
          "glutes",
          "hamstrings"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Lie face-down with your hips supported on a bench and upper body hanging off (have a partner hold your legs down securely). 2: Starting from a bent position with your upper body toward the floor, raise your torso by contracting your lower back muscles until your body is roughly in line. 3: Lower your torso under control back to the starting position."
      },
      {
        "name": "45° Back Extension",
        "primary_muscle": "lowerback",
        "secondary_muscles": [
          "glutes",
          "hamstrings"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Position yourself on a 45-degree back extension bench with your hips against the pad and ankles secured. 2: Begin with your upper body folded forward at the hips. Slowly raise your torso by contracting your lower back and glutes until your body forms a straight line. 3: Lower yourself back down in a controlled manner to the starting position."
      }
    ]
  },
  "obliques": {
    "exercises": [
      {
        "name": "Oblique Crunch",
        "primary_muscle": "obliques",
        "secondary_muscles": [
          "abdominals"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Lie on your back with knees bent and feet flat. Let both knees drop to one side so your hips are rotated. 2: With hands lightly behind your head, crunch upward, lifting your shoulders off the floor and targeting the side of your abdomen. 3: Lower back down and repeat for reps, then switch to crunching with knees dropped to the other side."
      },
      {
        "name": "Side Plank",
        "primary_muscle": "obliques",
        "secondary_muscles": [
          "abdominals",
          "shoulders"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Lie on your side and prop up on one forearm, elbow under shoulder, with your feet stacked. 2: Lift your hips off the ground so your body forms a straight line from head to feet, supporting yourself on your forearm and foot. 3: Hold this position, keeping your core tight. Lower and repeat on the other side."
      },
      {
        "name": "Dumbbell Side Bend",
        "primary_muscle": "obliques",
        "secondary_muscles": [],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Stand upright holding a dumbbell in one hand at your side, with the other hand on your hip. 2: Slowly bend at the waist toward the side holding the dumbbell, lowering the weight toward the floor without twisting your torso. 3: Use your opposite side oblique to pull your torso back upright. Complete reps on one side, then switch."
      },
      {
        "name": "Oblique Jackknife",
        "primary_muscle": "obliques",
        "secondary_muscles": [
          "abdominals"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Lie on your side with your bottom arm extended on the floor and top hand behind your head. Legs are straight and stacked. 2: Lift your top leg and upper body simultaneously, bringing your elbow toward your knee, contracting the side of your waist. 3: Lower your leg and upper body back down. Finish reps, then switch to the other side."
      },
      {
        "name": "Dumbbell Russian Twist",
        "primary_muscle": "obliques",
        "secondary_muscles": [
          "abdominals"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Sit on the floor with knees bent and feet hovering slightly off the ground, holding a dumbbell with both hands at chest level. 2: Lean back slightly and rotate your torso to one side, moving the dumbbell toward the floor beside your hip. 3: Rotate to the opposite side, moving the weight across your body, and continue alternating while keeping your core engaged."
      },
      {
        "name": "Landmine Oblique Twist",
        "primary_muscle": "obliques",
        "secondary_muscles": [
          "abdominals",
          "shoulders"
        ],
        "difficulty": "advanced",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Wedge one end of a barbell into a landmine attachment or corner and hold the other end with both hands at chest height, arms extended. 2: With feet shoulder-width apart, rotate your torso and arms to one side, lowering the bar toward your hip while keeping your arms mostly straight. 3: Use your core to rotate the bar up and over to the opposite side, then continue alternating sides in a controlled arc."
      }
    ]
  },
  "quads": {
    "exercises": [
      {
        "name": "Leg Extension",
        "primary_muscle": "quads",
        "secondary_muscles": [],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Sit in a leg extension machine with your ankles behind the padded bar. 2: Extend your knees to lift the weight, straightening your legs and squeezing your quadriceps at the top. 3: Lower the weight back down by bending your knees in a controlled manner to return to the starting position."
      },
      {
        "name": "Wall Sit",
        "primary_muscle": "quads",
        "secondary_muscles": [
          "glutes"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Stand with your back against a wall and your feet about two feet in front of you, shoulder-width apart. 2: Slide down the wall by bending your knees until your thighs are parallel to the floor (as if sitting on an invisible chair). 3: Hold this seated position, keeping your back against the wall and knees above ankles, for the desired time."
      },
      {
        "name": "Weighted Wall Sit",
        "primary_muscle": "quads",
        "secondary_muscles": [
          "glutes"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Assume a wall sit position with your back against a wall and knees at 90°. 2: Hold a weight (like a plate or dumbbell) against your chest while maintaining the wall sit. 3: Keep the position for the target duration, then carefully stand up and set the weight down."
      },
      {
        "name": "Barbell Back Squat",
        "primary_muscle": "quads",
        "secondary_muscles": [
          "glutes",
          "hamstrings",
          "lowerback"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Stand under a racked barbell and position it across your upper back, grip it with hands just outside shoulder-width. Unrack the bar and step back with feet shoulder-width apart. 2: Sit your hips back and bend your knees to squat down until your thighs are at least parallel to the floor. 3: Drive through your heels to stand back up, extending your hips and knees to return to the start."
      },
      {
        "name": "Dumbbell Goblet Squat",
        "primary_muscle": "quads",
        "secondary_muscles": [
          "glutes"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Stand with feet shoulder-width apart while holding a dumbbell vertically in front of your chest (goblet style). 2: Keeping your chest up, push your hips back and bend your knees to squat down, letting your elbows brush the insides of your knees. 3: Push through your heels to return to standing, squeezing your quads and glutes."
      }
    ]
  },
  "rear-shoulders": {
    "exercises": [
      {
        "name": "Dumbbell External Rotation",
        "primary_muscle": "rear-shoulders",
        "secondary_muscles": [
          "rotator cuff"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Hold a light dumbbell and lie on your side or stand with your upper arm at your side, elbow bent 90°, and forearm across your abdomen. 2: Rotate your arm outward, keeping your elbow fixed, to raise the dumbbell away from your stomach until your forearm points forward. 3: Slowly return to the start position. Perform reps, then switch arms."
      },
      {
        "name": "Machine Reverse Fly",
        "primary_muscle": "rear-shoulders",
        "secondary_muscles": [
          "traps-middle"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Sit in a reverse fly machine facing the pad, with arms extended forward to grasp the handles (palms facing inward or downward). 2: With a slight bend in your elbows, move the handles out and back in an arc, squeezing your shoulder blades together as you contract your rear shoulders. 3: Control the return as your arms come forward to the starting position."
      },
      {
        "name": "Machine Overhand Row",
        "primary_muscle": "rear-shoulders",
        "secondary_muscles": [
          "traps-middle",
          "biceps"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Sit at a rowing machine station and grab the handles with an overhand grip. 2: Keeping your back straight, pull the handles towards your chest, driving your elbows out and back to target the rear delts and upper back. 3: Slowly extend your arms forward to return to the starting position."
      },
      {
        "name": "Ring Rear Delt Fly",
        "primary_muscle": "rear-shoulders",
        "secondary_muscles": [
          "traps-middle"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Hold a pair of gymnastic rings or TRX handles and lean back with arms extended in front of you, body straight and heels on the floor. 2: Keeping a slight bend in your arms, open your arms out to the sides in a reverse fly motion, pulling your body upward as you squeeze your shoulder blades together. 3: Control yourself back down to the starting lean position with arms extended forward."
      }
    ]
  },
  "traps": {
    "exercises": [
      {
        "name": "Dumbbell Shrug",
        "primary_muscle": "traps",
        "secondary_muscles": [],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Stand upright holding a dumbbell in each hand at your sides. 2: Elevate your shoulders (shrug) straight up toward your ears as high as possible. 3: Pause briefly, then lower your shoulders back down to the starting position. Keep your arms straight and avoid rolling your shoulders."
      },
      {
        "name": "Band Horizontal Shrug",
        "primary_muscle": "traps",
        "secondary_muscles": [
          "traps-middle"
        ],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Anchor a resistance band at chest height and stand facing it, holding an end in each hand with arms extended in front of you. 2: Keeping your arms straight, squeeze your shoulder blades together to pull your shoulders back (as if trying to touch them behind you). 3: Release and allow your shoulders to come forward under tension, then repeat the scapular retraction."
      },
      {
        "name": "Barbell Silverback Shrug",
        "primary_muscle": "traps",
        "secondary_muscles": [
          "traps-middle"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Hold a barbell with an overhand grip, hinge at the hips so your torso is at roughly 45°. Let the bar hang at arm's length. 2: Without bending your elbows, squeeze your shoulder blades together and slightly up, lifting the barbell a bit by shrugging in this hinged position. 3: Lower the bar back to the full hang by relaxing your traps. Keep your back flat throughout the movement."
      },
      {
        "name": "Elevated Pike Shoulder Shrug",
        "primary_muscle": "traps",
        "secondary_muscles": [
          "front-shoulders"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Start in a pike position (hands on the floor, hips piked up, legs straight, body forming an inverted V shape). 2: Keeping your arms straight, shrug your shoulders downward (toward your ears), then push through your shoulders to return to the starting position. 3: This up-and-down shoulder movement (without elbow bend) engages the upper traps; repeat for reps."
      }
    ]
  },
  "traps-middle": {
    "exercises": [
      {
        "name": "Inverted Row",
        "primary_muscle": "traps-middle",
        "secondary_muscles": [
          "lats",
          "biceps"
        ],
        "difficulty": "beginner",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Lie underneath a bar (set around waist height) and grab it with an overhand shoulder-width grip. 2: Keep your body straight and heels on the floor as you pull your chest up toward the bar by squeezing your shoulder blades together. 3: Lower yourself back down until your arms are straight. Repeat for reps."
      },
      {
        "name": "Barbell High Pull",
        "primary_muscle": "traps-middle",
        "secondary_muscles": [
          "traps",
          "shoulders"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Stand with feet shoulder-width and hold a barbell at thigh level with an overhand grip. 2: Explosively extend your hips and shrug your shoulders to pull the bar upward, bending your elbows to bring the bar up toward your upper chest (keeping elbows high and out to the sides). 3: Control the bar back down to the start position."
      },
      {
        "name": "Barbell Deadlift",
        "primary_muscle": "traps-middle",
        "secondary_muscles": [
          "glutes",
          "hamstrings",
          "lowerback"
        ],
        "difficulty": "advanced",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Stand with feet hip-width apart, mid-foot under a barbell. Bend at your hips and knees to grip the bar just outside your knees. Keep your back flat and chest up. 2: Drive through your heels to lift the bar, extending your hips and knees. Stand upright with the barbell, locking out your hips and pulling your shoulders back. 3: Lower the bar to the floor by pushing your hips back and bending your knees, maintaining a flat back as you return to the start."
      },
      {
        "name": "Barbell Landmine Row",
        "primary_muscle": "traps-middle",
        "secondary_muscles": [
          "lats",
          "biceps"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Wedge one end of a barbell in a corner or landmine attachment. Stand over the bar and grab the loaded end with both hands (or a V-handle) while bent at the hips with back flat. 2: Row the barbell toward your chest by squeezing your shoulder blades together and driving elbows back. 3: Lower the bar under control until your arms are extended again, keeping your back flat."
      }
    ]
  },
  "triceps": {
    "exercises": [
      {
        "name": "Dumbbell Skullcrusher",
        "primary_muscle": "triceps",
        "secondary_muscles": [],
        "difficulty": "beginner",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Lie on a flat bench holding two dumbbells straight above you, arms extended and palms facing each other. 2: Keeping your upper arms stationary, bend your elbows to lower the dumbbells toward your forehead (or just above your head) in a controlled motion. 3: Extend your elbows to raise the dumbbells back to the starting position, contracting your triceps."
      },
      {
        "name": "Cable Rope Pushdown",
        "primary_muscle": "triceps",
        "secondary_muscles": [],
        "difficulty": "novice",
        "equipment": {
          "type": "gym",
          "subtype": "machine"
        },
        "instructions": "1: Stand facing a high pulley with a rope attachment. Grasp the rope ends with palms facing inward and elbows at your sides. 2: Keeping your elbows pinned, extend your arms by pushing the rope down toward your thighs, spreading the rope slightly at the bottom of the motion. 3: Squeeze your triceps, then allow your forearms to rise back up in a controlled manner to the starting position."
      },
      {
        "name": "Close-Grip Bench Press",
        "primary_muscle": "triceps",
        "secondary_muscles": [
          "chest"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "gym",
          "subtype": "barbell"
        },
        "instructions": "1: Lie on a flat bench and grip the barbell with hands about shoulder-width apart (closer than a standard bench press). 2: Unrack the bar and hold it above your chest, then bend your elbows to lower the barbell to mid-chest while keeping your elbows tucked near your sides. 3: Press the barbell back up to the starting position by extending your arms, focusing on contracting your triceps."
      },
      {
        "name": "Bodyweight Tricep Extension",
        "primary_muscle": "triceps",
        "secondary_muscles": [
          "shoulders"
        ],
        "difficulty": "intermediate",
        "equipment": {
          "type": "bodyweight"
        },
        "instructions": "1: Stand facing a waist-high bar or railing and grip it with hands shoulder-width apart. Step back so your body is inclined and arms extended in front of you. 2: Keeping your body straight, bend your elbows to lower your head under the bar, like a close-grip push-up motion, until your head passes below the bar. 3: Press through your hands to straighten your arms and return to the inclined plank position."
      },
      {
        "name": "Dumbbell Rolling Tricep Extension",
        "primary_muscle": "triceps",
        "secondary_muscles": [
          "chest"
        ],
        "difficulty": "advanced",
        "equipment": {
          "type": "gym",
          "subtype": "dumbbells"
        },
        "instructions": "1: Lie on a flat bench with a dumbbell in each hand, arms extended above and palms facing each other. 2: Begin to lower the dumbbells by bending your elbows, then simultaneously allow your upper arms to drift back toward your head (as if doing a skullcrusher and a pullover combination). 3: Once the dumbbells are near your ears, reverse the motion by engaging your triceps to extend your arms and rolling your upper arms back to vertical, returning to the start."
      }
    ]
  }
}
